// Напишите программу, 
// которая принимает на вход число N 
// и выдает произведение чисел от 1 до N.

Console.WriteLine("Введите число");
double number = Convert.ToInt32(Console.ReadLine());

