// Напишите решения 
// Напишите программу,
// 1. которая на вход
// принимает число и 
// 2. выдает его квадрат
// (число умноженное на сабо себя)
// Например: 
// 4 -> 16
// -3 -> 9
// -7 -> 49

int num = 4;
int res = num * num;
Console.WriteLine(res);