// Напишите программу, 
// которая выводит третью цифру 
// заданного числа или сообщает, 
// что третий цифры нет.
// 645 -> 5
// 78 -> Третий цифры нет
// 32679 -> 6

Console.WriteLine("Введите число ");
int num = Convert.ToInt32(Console.ReadLine());



